---
type: RuledSurface
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# RuledSurface

`Autodesk.Revit.DB.RuledSurface` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetFirstProfileCurve | 2017 | `public Curve GetFirstProfileCurve ()` |
| Method | GetFirstProfilePoint | 2017 | `public XYZ GetFirstProfilePoint ()` |
| Method | GetSecondProfileCurve | 2017 | `public Curve GetSecondProfileCurve ()` |
| Method | GetSecondProfilePoint | 2017 | `public XYZ GetSecondProfilePoint ()` |
| Method | HasFirstProfilePoint | 2018 | `public bool HasFirstProfilePoint ()` |
| Method | HasSecondProfilePoint | 2018 | `public bool HasSecondProfilePoint ()` |